{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PRODUCT_TYPE",
    "2": "I-PRODUCT_TYPE",
    "3": "B-BRAND",
    "4": "I-BRAND",
    "5": "B-MATERIAL",
    "6": "I-MATERIAL",
    "7": "B-COLOR",
    "8": "I-COLOR",
    "9": "B-SIZE_MEASURE",
    "10": "I-SIZE_MEASURE",
    "11": "B-ATTRIBUTE_VALUE",
    "12": "I-ATTRIBUTE_VALUE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ATTRIBUTE_VALUE": 11,
    "B-BRAND": 3,
    "B-COLOR": 7,
    "B-MATERIAL": 5,
    "B-PRODUCT_TYPE": 1,
    "B-SIZE_MEASURE": 9,
    "I-ATTRIBUTE_VALUE": 12,
    "I-BRAND": 4,
    "I-COLOR": 8,
    "I-MATERIAL": 6,
    "I-PRODUCT_TYPE": 2,
    "I-SIZE_MEASURE": 10,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
